MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45J11/mcu.h
extern volatile PMMODEHbits_t PMMODEHbits __at(0xF5D);
// bitfield macros
#define _PMMODEH_MODE0_POSN                                 0x0
#define _PMMODEH_MODE0_POSITION                             0x0
#define _PMMODEH_MODE0_SIZE                                 0x1
#define _PMMODEH_MODE0_LENGTH                               0x1
#define _PMMODEH_MODE0_MASK                                 0x1
#define _PMMODEH_MODE1_POSN                                 0x1
#define _PMMODEH_MODE1_POSITION                             0x1
#define _PMMODEH_MODE1_SIZE                                 0x1
#define _PMMODEH_MODE1_LENGTH                               0x1
#define _PMMODEH_MODE1_MASK                                 0x2
#define _PMMODEH_MODE16_POSN                                0x2
#define _PMMODEH_MODE16_POSITION                            0x2
#define _PMMODEH_MODE16_SIZE                                0x1
#define _PMMODEH_MODE16_LENGTH                              0x1
#define _PMMODEH_MODE16_MASK                                0x4
#define _PMMODEH_INCM0_POSN                                 0x3
#define _PMMODEH_INCM0_POSITION                             0x3
#define _PMMODEH_INCM0_SIZE                                 0x1
#define _PMMODEH_INCM0_LENGTH                               0x1
#define _PMMODEH_INCM0_MASK                                 0x8
#define _PMMODEH_INCM1_POSN                                 0x4
#define _PMMODEH_INCM1_POSITION                             0x4
#define _PMMODEH_INCM1_SIZE                                 0x1
#define _PMMODEH_INCM1_LENGTH                               0x1
#define _PMMODEH_INCM1_MASK                                 0x10
#define _PMMODEH_IRQM0_POSN                                 0x5
#define _PMMODEH_IRQM0_POSITION                             0x5
#define _PMMODEH_IRQM0_SIZE                                 0x1
#define _PMMODEH_IRQM0_LENGTH                               0x1
#define _PMMODEH_IRQM0_MASK                                 0x20
#define _PMMODEH_IRQM1_POSN                                 0x6
#define _PMMODEH_IRQM1_POSITION                             0x6
#define _PMMODEH_IRQM1_SIZE                                 0x1
#define _PMMODEH_IRQM1_LENGTH                               0x1
#define _PMMODEH_IRQM1_MASK                                 0x40
#define _PMMODEH_BUSY_POSN                                  0x7
#define _PMMODEH_BUSY_POSITION                              0x7
#define _PMMODEH_BUSY_SIZE                                  0x1
#define _PMMODEH_BUSY_LENGTH                                0x1
#define _PMMODEH_BUSY_MASK                                  0x80

// Register: PMCONL
#define PMCONL PMCONL
extern volatile unsigned char           PMCONL              __at(0xF5E);
#ifndef _LIB_BUILD
asm("PMCONL equ 0F5Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RDSP                   :1;
        unsigned WRSP                   :1;
        unsigned BEP                    :1;
        unsigned CS1P                   :1;
        unsigned CS2P                   :1;
        unsigned ALP                    :1;
        unsigned CSF0                   :1;
        unsigned CSF1                   :1;
    };
} PMCONLbits_t;
extern volatile PMCONLbits_t PMCONLbits __at(0xF5E);
// bitfield macros
#define _PMCONL_RDSP_POSN                                   0x0
#define _PMCONL_RDSP_POSITION                               0x0
#define _PMCONL_RDSP_SIZE                                   0x1
#define _PMCONL_RDSP_LENGTH                                 0x1
#define _PMCONL_RDSP_MASK                                   0x1
#define _PMCONL_WRSP_POSN                                   0x1
#define _PMCONL_WRSP_POSITION                               0x1
#define _PMCONL_WRSP_SIZE                                   0x1
#define _PMCONL_WRSP_LENGTH                                 0x1
#define _PMCONL_WRSP_MASK                                   0x2
#define _PMCONL_BEP_POSN                                    0x2
#define _PMCONL_BEP_POSITION                                0x2
#define _PMCONL_BEP_SIZE                                    0x1
#define _PMCONL_BEP_LENGTH                                  0x1
#define _PMCONL_BEP_MASK                                    0x4
#define _PMCONL_CS1P_POSN                                   0x3
#define _PMCONL_CS1P_POSITION                               0x3
#define _PMCONL_CS1P_SIZE                                   0x1
#define _PMCONL_CS1P_LENGTH                                 0x1
#define _PMCONL_CS1P_MASK                                   0x8
#define _PMCONL_CS2P_POSN                                   0x4
#define _PMCONL_CS2P_POSITION                               0x4
#define _PMCONL_CS2P_SIZE                                   0x1
#define _PMCONL_CS2P_LENGTH                                 0x1
#define _PMCONL_CS2P_MASK                                   0x10
#define _PMCONL_ALP_POSN                                    0x5
#define _PMCONL_ALP_POSITION                                0x5
#define _PMCONL_ALP_SIZE                                    0x1
#define _PMCONL_ALP_LENGTH                                  0x1
#define _PMCONL_ALP_MASK                                    0x20
#define _PMCONL_CSF0_POSN                                   0x6
#define _PMCONL_CSF0_POSITION                               0x6
#define _PMCONL_CSF0_SIZE                                   0x1
#define _PMCONL_CSF0_LENGTH                                 0x1
#define _PMCONL_CSF0_MASK                                   0x40
#define _PMCONL_CSF1_POSN                                   0x7
#define _PMCONL_CSF1_POSITION                               0x7
#define _PMCONL_CSF1_SIZE                                   0x1
#define _PMCONL_CSF1_LENGTH                                 0x1
#define _PMCONL_CSF1_MASK                                   0x80

// Register: PMCONH
#define PMCONH PMCONH
extern volatile unsigned char           PMCONH              __at(0xF5F);
#ifndef _LIB_BUILD
asm("PMCONH equ 0F5Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PTRDEN                 :1;
        unsigned PTWREN                 :1;
        unsigned PTBEEN                 :1;
        unsigned ADRMUX0                :1;
        unsigned ADRMUX1                :1;
        unsigned PSIDL                  :1;
        unsigned                        :1;
        unsigned PMPEN                  :1;
    };
} PMCONHbits_t;
