MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45J11/mcu.h
#define                                 DSEN_bit            _BIT_ACCESS(DSCONH,7)
// DSWAKEL<DSFLT>
extern volatile __bit                   DSFLT               __at(0x7A57);	// @ (0xF4A * 8 + 7)
#define                                 DSFLT_bit           _BIT_ACCESS(DSWAKEL,7)
// DSWAKEH<DSINT0>
extern volatile __bit                   DSINT0              __at(0x7A58);	// @ (0xF4B * 8 + 0)
#define                                 DSINT0_bit          _BIT_ACCESS(DSWAKEH,0)
// DSWAKEL<DSMCLR>
extern volatile __bit                   DSMCLR              __at(0x7A52);	// @ (0xF4A * 8 + 2)
#define                                 DSMCLR_bit          _BIT_ACCESS(DSWAKEL,2)
// DSWAKEL<DSPOR>
extern volatile __bit                   DSPOR               __at(0x7A50);	// @ (0xF4A * 8 + 0)
#define                                 DSPOR_bit           _BIT_ACCESS(DSWAKEL,0)
// DSWAKEL<DSRTC>
extern volatile __bit                   DSRTC               __at(0x7A53);	// @ (0xF4A * 8 + 3)
#define                                 DSRTC_bit           _BIT_ACCESS(DSWAKEL,3)
// DSWAKEL<DSULP>
extern volatile __bit                   DSULP               __at(0x7A55);	// @ (0xF4A * 8 + 5)
#define                                 DSULP_bit           _BIT_ACCESS(DSWAKEL,5)
// DSCONH<DSULPEN>
extern volatile __bit                   DSULPEN             __at(0x7A69);	// @ (0xF4D * 8 + 1)
#define                                 DSULPEN_bit         _BIT_ACCESS(DSCONH,1)
// DSWAKEL<DSWDT>
extern volatile __bit                   DSWDT               __at(0x7A54);	// @ (0xF4A * 8 + 4)
#define                                 DSWDT_bit           _BIT_ACCESS(DSWAKEL,4)
// PORTC<DT1>
extern volatile __bit                   DT1                 __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 DT1_bit             _BIT_ACCESS(PORTC,7)
// BAUDCON1<DTRXP>
extern volatile __bit                   DTRXP               __at(0x7BF5);	// @ (0xF7E * 8 + 5)
#define                                 DTRXP_bit           _BIT_ACCESS(BAUDCON1,5)
// BAUDCON1<DTRXP1>
extern volatile __bit                   DTRXP1              __at(0x7BF5);	// @ (0xF7E * 8 + 5)
#define                                 DTRXP1_bit          _BIT_ACCESS(BAUDCON1,5)
// BAUDCON2<DTRXP2>
extern volatile __bit                   DTRXP2              __at(0x7BE5);	// @ (0xF7C * 8 + 5)
#define                                 DTRXP2_bit          _BIT_ACCESS(BAUDCON2,5)
// DMACON1<DUPLEX0>
extern volatile __bit                   DUPLEX0             __at(0x7C42);	// @ (0xF88 * 8 + 2)
#define                                 DUPLEX0_bit         _BIT_ACCESS(DMACON1,2)
// DMACON1<DUPLEX1>
extern volatile __bit                   DUPLEX1             __at(0x7C43);	// @ (0xF88 * 8 + 3)
#define                                 DUPLEX1_bit         _BIT_ACCESS(DMACON1,3)
// SSP1STAT<D_A>
extern volatile __bit                   D_A                 __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_A_bit             _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<D_A2>
extern volatile __bit                   D_A2                __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 D_A2_bit            _BIT_ACCESS(SSP2STAT,5)
// SSP2STAT<D_NOT_A2>
extern volatile __bit                   D_NOT_A2            __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 D_NOT_A2_bit        _BIT_ACCESS(SSP2STAT,5)
// SSP1STAT<D_nA>
extern volatile __bit _DEPRECATED       D_nA                __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<D_nA2>
extern volatile __bit                   D_nA2               __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 D_nA2_bit           _BIT_ACCESS(SSP2STAT,5)
// PR2<EBDIS>
extern volatile __bit                   EBDIS               __at(0x7E5F);	// @ (0xFCB * 8 + 7)
#define                                 EBDIS_bit           _BIT_ACCESS(_PR2,7)  // Note: Changed by MikroE
// ECCP1AS<ECCP1AS0>
extern volatile __bit                   ECCP1AS0            __at(0x7DF4);	// @ (0xFBE * 8 + 4)
#define                                 ECCP1AS0_bit        _BIT_ACCESS(ECCP1AS,4)
// ECCP1AS<ECCP1AS1>
extern volatile __bit                   ECCP1AS1            __at(0x7DF5);	// @ (0xFBE * 8 + 5)
#define                                 ECCP1AS1_bit        _BIT_ACCESS(ECCP1AS,5)
// ECCP1AS<ECCP1AS2>
extern volatile __bit                   ECCP1AS2            __at(0x7DF6);	// @ (0xFBE * 8 + 6)
#define                                 ECCP1AS2_bit        _BIT_ACCESS(ECCP1AS,6)
// ECCP1AS<ECCP1ASE>
extern volatile __bit                   ECCP1ASE            __at(0x7DF7);	// @ (0xFBE * 8 + 7)
#define                                 ECCP1ASE_bit        _BIT_ACCESS(ECCP1AS,7)
// ODCON1<ECCP1OD>
extern volatile __bit                   ECCP1OD             __at(0x7A10);	// @ (0xF42 * 8 + 0)
#define                                 ECCP1OD_bit         _BIT_ACCESS(ODCON1,0)
// ECCP2AS<ECCP2AS0>
extern volatile __bit                   ECCP2AS0            __at(0x7DC4);	// @ (0xFB8 * 8 + 4)
#define                                 ECCP2AS0_bit        _BIT_ACCESS(ECCP2AS,4)
// ECCP2AS<ECCP2AS1>
extern volatile __bit                   ECCP2AS1            __at(0x7DC5);	// @ (0xFB8 * 8 + 5)
#define                                 ECCP2AS1_bit        _BIT_ACCESS(ECCP2AS,5)
// ECCP2AS<ECCP2AS2>
extern volatile __bit                   ECCP2AS2            __at(0x7DC6);	// @ (0xFB8 * 8 + 6)
#define                                 ECCP2AS2_bit        _BIT_ACCESS(ECCP2AS,6)
// ECCP2AS<ECCP2ASE>
extern volatile __bit                   ECCP2ASE            __at(0x7DC7);	// @ (0xFB8 * 8 + 7)
#define                                 ECCP2ASE_bit        _BIT_ACCESS(ECCP2AS,7)
// ODCON1<ECCP2OD>
extern volatile __bit                   ECCP2OD             __at(0x7A11);	// @ (0xF42 * 8 + 1)
#define                                 ECCP2OD_bit         _BIT_ACCESS(ODCON1,1)
// CTMUCONL<EDG1POL>
extern volatile __bit                   EDG1POL             __at(0x7D94);	// @ (0xFB2 * 8 + 4)
#define                                 EDG1POL_bit         _BIT_ACCESS(CTMUCONL,4)
// CTMUCONL<EDG1SEL0>
extern volatile __bit                   EDG1SEL0            __at(0x7D92);	// @ (0xFB2 * 8 + 2)
#define                                 EDG1SEL0_bit        _BIT_ACCESS(CTMUCONL,2)
// CTMUCONL<EDG1SEL1>
extern volatile __bit                   EDG1SEL1            __at(0x7D93);	// @ (0xFB2 * 8 + 3)
#define                                 EDG1SEL1_bit        _BIT_ACCESS(CTMUCONL,3)
// CTMUCONL<EDG1STAT>
extern volatile __bit                   EDG1STAT            __at(0x7D90);	// @ (0xFB2 * 8 + 0)
#define                                 EDG1STAT_bit        _BIT_ACCESS(CTMUCONL,0)
// CTMUCONL<EDG2POL>
extern volatile __bit                   EDG2POL             __at(0x7D97);	// @ (0xFB2 * 8 + 7)
#define                                 EDG2POL_bit         _BIT_ACCESS(CTMUCONL,7)
// CTMUCONL<EDG2SEL0>
extern volatile __bit                   EDG2SEL0            __at(0x7D95);	// @ (0xFB2 * 8 + 5)
#define                                 EDG2SEL0_bit        _BIT_ACCESS(CTMUCONL,5)
// CTMUCONL<EDG2SEL1>
extern volatile __bit                   EDG2SEL1            __at(0x7D96);	// @ (0xFB2 * 8 + 6)
#define                                 EDG2SEL1_bit        _BIT_ACCESS(CTMUCONL,6)
// CTMUCONL<EDG2STAT>
extern volatile __bit                   EDG2STAT            __at(0x7D91);	// @ (0xFB2 * 8 + 1)
#define                                 EDG2STAT_bit        _BIT_ACCESS(CTMUCONL,1)
// CTMUCONH<EDGEN>
extern volatile __bit                   EDGEN               __at(0x7D9B);	// @ (0xFB3 * 8 + 3)
#define                                 EDGEN_bit           _BIT_ACCESS(CTMUCONH,3)
// CTMUCONH<EDGSEQEN>
extern volatile __bit                   EDGSEQEN            __at(0x7D9A);	// @ (0xFB3 * 8 + 2)
#define                                 EDGSEQEN_bit        _BIT_ACCESS(CTMUCONH,2)
// CM1CON<EVPOL0>
extern volatile __bit _DEPRECATED       EVPOL0              __at(0x7E93);	// @ (0xFD2 * 8 + 3)
#define                                 EVPOL0_bit          _BIT_ACCESS(CM1CON,3)
// CM1CON<EVPOL01>
extern volatile __bit                   EVPOL01             __at(0x7E93);	// @ (0xFD2 * 8 + 3)
#define                                 EVPOL01_bit         _BIT_ACCESS(CM1CON,3)
// CM2CON<EVPOL02>
extern volatile __bit                   EVPOL02             __at(0x7E8B);	// @ (0xFD1 * 8 + 3)
#define                                 EVPOL02_bit         _BIT_ACCESS(CM2CON,3)
// CM1CON<EVPOL1>
extern volatile __bit _DEPRECATED       EVPOL1              __at(0x7E94);	// @ (0xFD2 * 8 + 4)
#define                                 EVPOL1_bit          _BIT_ACCESS(CM1CON,4)
// CM1CON<EVPOL11>
extern volatile __bit                   EVPOL11             __at(0x7E94);	// @ (0xFD2 * 8 + 4)
#define                                 EVPOL11_bit         _BIT_ACCESS(CM1CON,4)
// CM2CON<EVPOL12>
extern volatile __bit                   EVPOL12             __at(0x7E8C);	// @ (0xFD1 * 8 + 4)
#define                                 EVPOL12_bit         _BIT_ACCESS(CM2CON,4)
// RCSTA1<FERR>
extern volatile __bit _DEPRECATED       FERR                __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RCSTA1,2)
// RCSTA1<FERR1>
extern volatile __bit                   FERR1               __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 FERR1_bit           _BIT_ACCESS(RCSTA1,2)
// RCSTA2<FERR2>
extern volatile __bit                   FERR2               __at(0x7CE2);	// @ (0xF9C * 8 + 2)
#define                                 FERR2_bit           _BIT_ACCESS(RCSTA2,2)
// EECON1<FREE>
extern volatile __bit                   FREE                __at(0x7D34);	// @ (0xFA6 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(EECON1,4)
// SSP1CON2<GCEN>
extern volatile __bit _DEPRECATED       GCEN                __at(0x7E2F);	// @ (0xFC5 * 8 + 7)
#define                                 GCEN_bit            _BIT_ACCESS(SSP1CON2,7)
// SSP1CON2<GCEN1>
extern volatile __bit                   GCEN1               __at(0x7E2F);	// @ (0xFC5 * 8 + 7)
#define                                 GCEN1_bit           _BIT_ACCESS(SSP1CON2,7)
// SSP2CON2<GCEN2>
extern volatile __bit                   GCEN2               __at(0x7B8F);	// @ (0xF71 * 8 + 7)
#define                                 GCEN2_bit           _BIT_ACCESS(SSP2CON2,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// INTCON<GIEH>
extern volatile __bit                   GIEH                __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIEH_bit            _BIT_ACCESS(INTCON,7)
// INTCON<GIEL>
extern volatile __bit                   GIEL                __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 GIEL_bit            _BIT_ACCESS(INTCON,6)
// INTCON<GIE_GIEH>
extern volatile __bit                   GIE_GIEH            __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIE_GIEH_bit        _BIT_ACCESS(INTCON,7)
// ADCON0<GO>
extern volatile __bit                   GO                  __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GO_bit              _BIT_ACCESS(ADCON0,1)
// ADCON0<GODONE>
extern volatile __bit                   GODONE              __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GODONE_bit          _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_DONE>
extern volatile __bit                   GO_DONE             __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GO_DONE_bit         _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_NOT_DONE>
extern volatile __bit                   GO_NOT_DONE         __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GO_NOT_DONE_bit     _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// RTCCFG<HALFSEC>
extern volatile __bit                   HALFSEC             __at(0x79FB);	// @ (0xF3F * 8 + 3)
#define                                 HALFSEC_bit         _BIT_ACCESS(RTCCFG,3)
// HLVDCON<HLVDEN>
extern volatile __bit                   HLVDEN              __at(0x7C2C);	// @ (0xF85 * 8 + 4)
#define                                 HLVDEN_bit          _BIT_ACCESS(HLVDCON,4)
// PORTA<HLVDIN>
extern volatile __bit                   HLVDIN              __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 HLVDIN_bit          _BIT_ACCESS(PORTA,5)
// HLVDCON<HLVDL0>
extern volatile __bit                   HLVDL0              __at(0x7C28);	// @ (0xF85 * 8 + 0)
#define                                 HLVDL0_bit          _BIT_ACCESS(HLVDCON,0)
// HLVDCON<HLVDL1>
extern volatile __bit                   HLVDL1              __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 HLVDL1_bit          _BIT_ACCESS(HLVDCON,1)
// HLVDCON<HLVDL2>
extern volatile __bit                   HLVDL2              __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 HLVDL2_bit          _BIT_ACCESS(HLVDCON,2)
// HLVDCON<HLVDL3>
extern volatile __bit                   HLVDL3              __at(0x7C2B);	// @ (0xF85 * 8 + 3)
#define                                 HLVDL3_bit          _BIT_ACCESS(HLVDCON,3)
// SSP1STAT<I2C_DAT>
extern volatile __bit                   I2C_DAT             __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 I2C_DAT_bit         _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<I2C_DAT2>
extern volatile __bit                   I2C_DAT2            __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 I2C_DAT2_bit        _BIT_ACCESS(SSP2STAT,5)
// SSP1STAT<I2C_READ>
extern volatile __bit                   I2C_READ            __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 I2C_READ_bit        _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<I2C_READ2>
extern volatile __bit                   I2C_READ2           __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 I2C_READ2_bit       _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<I2C_START>
extern volatile __bit                   I2C_START           __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 I2C_START_bit       _BIT_ACCESS(SSP1STAT,3)
// SSP2STAT<I2C_START2>
extern volatile __bit                   I2C_START2          __at(0x7B9B);	// @ (0xF73 * 8 + 3)
#define                                 I2C_START2_bit      _BIT_ACCESS(SSP2STAT,3)
// SSP1STAT<I2C_STOP>
extern volatile __bit                   I2C_STOP            __at(0x7E3C);	// @ (0xFC7 * 8 + 4)
#define                                 I2C_STOP_bit        _BIT_ACCESS(SSP1STAT,4)
// SSP2STAT<I2C_STOP2>
extern volatile __bit                   I2C_STOP2           __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 I2C_STOP2_bit       _BIT_ACCESS(SSP2STAT,4)
// PMSTATH<IB0F>
extern volatile __bit                   IB0F                __at(0x7AA8);	// @ (0xF55 * 8 + 0)
#define                                 IB0F_bit            _BIT_ACCESS(PMSTATH,0)
// PMSTATH<IB1F>
extern volatile __bit                   IB1F                __at(0x7AA9);	// @ (0xF55 * 8 + 1)
#define                                 IB1F_bit            _BIT_ACCESS(PMSTATH,1)
// PMSTATH<IB2F>
extern volatile __bit                   IB2F                __at(0x7AAA);	// @ (0xF55 * 8 + 2)
#define                                 IB2F_bit            _BIT_ACCESS(PMSTATH,2)
// PMSTATH<IB3F>
extern volatile __bit                   IB3F                __at(0x7AAB);	// @ (0xF55 * 8 + 3)
#define                                 IB3F_bit            _BIT_ACCESS(PMSTATH,3)
// PMSTATH<IBF>
extern volatile __bit                   IBF                 __at(0x7AAF);	// @ (0xF55 * 8 + 7)
#define                                 IBF_bit             _BIT_ACCESS(PMSTATH,7)
// PMSTATH<IBOV>
extern volatile __bit                   IBOV                __at(0x7AAE);	// @ (0xF55 * 8 + 6)
#define                                 IBOV_bit            _BIT_ACCESS(PMSTATH,6)
// CTMUCONH<IDISSEN>
extern volatile __bit                   IDISSEN             __at(0x7D99);	// @ (0xFB3 * 8 + 1)
#define                                 IDISSEN_bit         _BIT_ACCESS(CTMUCONH,1)
// OSCCON<IDLEN>
extern volatile __bit                   IDLEN               __at(0x7E9F);	// @ (0xFD3 * 8 + 7)
#define                                 IDLEN_bit           _BIT_ACCESS(OSCCON,7)
// PMMODEH<INCM0>
extern volatile __bit                   INCM0               __at(0x7AEB);	// @ (0xF5D * 8 + 3)
#define                                 INCM0_bit           _BIT_ACCESS(PMMODEH,3)
// PMMODEH<INCM1>
extern volatile __bit                   INCM1               __at(0x7AEC);	// @ (0xF5D * 8 + 4)
#define                                 INCM1_bit           _BIT_ACCESS(PMMODEH,4)
// PORTB<INT0>
extern volatile __bit                   INT0                __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 INT0_bit            _BIT_ACCESS(PORTB,0)
// INTCON<INT0E>
extern volatile __bit                   INT0E               __at(0x7F94);	// @ (0xFF2 * 8 + 4)
#define                                 INT0E_bit           _BIT_ACCESS(INTCON,4)
// INTCON<INT0F>
extern volatile __bit                   INT0F               __at(0x7F91);	// @ (0xFF2 * 8 + 1)
#define                                 INT0F_bit           _BIT_ACCESS(INTCON,1)
// INTCON<INT0IE>
extern volatile __bit                   INT0IE              __at(0x7F94);	// @ (0xFF2 * 8 + 4)
#define                                 INT0IE_bit          _BIT_ACCESS(INTCON,4)
// INTCON<INT0IF>
extern volatile __bit                   INT0IF              __at(0x7F91);	// @ (0xFF2 * 8 + 1)
#define                                 INT0IF_bit          _BIT_ACCESS(INTCON,1)
// INTCON3<INT1E>
extern volatile __bit                   INT1E               __at(0x7F83);	// @ (0xFF0 * 8 + 3)
#define                                 INT1E_bit           _BIT_ACCESS(INTCON3,3)
// INTCON3<INT1F>
extern volatile __bit                   INT1F               __at(0x7F80);	// @ (0xFF0 * 8 + 0)
#define                                 INT1F_bit           _BIT_ACCESS(INTCON3,0)
// INTCON3<INT1IE>
extern volatile __bit                   INT1IE              __at(0x7F83);	// @ (0xFF0 * 8 + 3)
#define                                 INT1IE_bit          _BIT_ACCESS(INTCON3,3)
// INTCON3<INT1IF>
extern volatile __bit                   INT1IF              __at(0x7F80);	// @ (0xFF0 * 8 + 0)
#define                                 INT1IF_bit          _BIT_ACCESS(INTCON3,0)
// INTCON3<INT1IP>
extern volatile __bit                   INT1IP              __at(0x7F86);	// @ (0xFF0 * 8 + 6)
#define                                 INT1IP_bit          _BIT_ACCESS(INTCON3,6)
// INTCON3<INT1P>
extern volatile __bit                   INT1P               __at(0x7F86);	// @ (0xFF0 * 8 + 6)
#define                                 INT1P_bit           _BIT_ACCESS(INTCON3,6)
// INTCON3<INT2E>
extern volatile __bit                   INT2E               __at(0x7F84);	// @ (0xFF0 * 8 + 4)
#define                                 INT2E_bit           _BIT_ACCESS(INTCON3,4)
// INTCON3<INT2F>
extern volatile __bit                   INT2F               __at(0x7F81);	// @ (0xFF0 * 8 + 1)
#define                                 INT2F_bit           _BIT_ACCESS(INTCON3,1)
// INTCON3<INT2IE>
extern volatile __bit                   INT2IE              __at(0x7F84);	// @ (0xFF0 * 8 + 4)
#define                                 INT2IE_bit          _BIT_ACCESS(INTCON3,4)
// INTCON3<INT2IF>
extern volatile __bit                   INT2IF              __at(0x7F81);	// @ (0xFF0 * 8 + 1)
#define                                 INT2IF_bit          _BIT_ACCESS(INTCON3,1)
// INTCON3<INT2IP>
extern volatile __bit                   INT2IP              __at(0x7F87);	// @ (0xFF0 * 8 + 7)
#define                                 INT2IP_bit          _BIT_ACCESS(INTCON3,7)
// INTCON3<INT2P>
extern volatile __bit                   INT2P               __at(0x7F87);	// @ (0xFF0 * 8 + 7)
#define                                 INT2P_bit           _BIT_ACCESS(INTCON3,7)
// INTCON3<INT3E>
extern volatile __bit                   INT3E               __at(0x7F85);	// @ (0xFF0 * 8 + 5)
#define                                 INT3E_bit           _BIT_ACCESS(INTCON3,5)
// INTCON3<INT3F>
extern volatile __bit                   INT3F               __at(0x7F82);	// @ (0xFF0 * 8 + 2)
#define                                 INT3F_bit           _BIT_ACCESS(INTCON3,2)
// INTCON3<INT3IE>
extern volatile __bit                   INT3IE              __at(0x7F85);	// @ (0xFF0 * 8 + 5)
#define                                 INT3IE_bit          _BIT_ACCESS(INTCON3,5)
// INTCON3<INT3IF>
extern volatile __bit                   INT3IF              __at(0x7F82);	// @ (0xFF0 * 8 + 2)
#define                                 INT3IF_bit          _BIT_ACCESS(INTCON3,2)
// INTCON2<INT3IP>
extern volatile __bit                   INT3IP              __at(0x7F89);	// @ (0xFF1 * 8 + 1)
#define                                 INT3IP_bit          _BIT_ACCESS(INTCON2,1)
// INTCON2<INT3P>
extern volatile __bit                   INT3P               __at(0x7F89);	// @ (0xFF1 * 8 + 1)
#define                                 INT3P_bit           _BIT_ACCESS(INTCON2,1)
// INTCON2<INTEDG0>
extern volatile __bit                   INTEDG0             __at(0x7F8E);	// @ (0xFF1 * 8 + 6)
#define                                 INTEDG0_bit         _BIT_ACCESS(INTCON2,6)
// INTCON2<INTEDG1>
extern volatile __bit                   INTEDG1             __at(0x7F8D);	// @ (0xFF1 * 8 + 5)
#define                                 INTEDG1_bit         _BIT_ACCESS(INTCON2,5)
// INTCON2<INTEDG2>
extern volatile __bit                   INTEDG2             __at(0x7F8C);	// @ (0xFF1 * 8 + 4)
#define                                 INTEDG2_bit         _BIT_ACCESS(INTCON2,4)
// INTCON2<INTEDG3>
extern volatile __bit                   INTEDG3             __at(0x7F8B);	// @ (0xFF1 * 8 + 3)
#define                                 INTEDG3_bit         _BIT_ACCESS(INTCON2,3)
// DMACON2<INTLVL0>
extern volatile __bit                   INTLVL0             __at(0x7C30);	// @ (0xF86 * 8 + 0)
#define                                 INTLVL0_bit         _BIT_ACCESS(DMACON2,0)
// DMACON2<INTLVL1>
extern volatile __bit                   INTLVL1             __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 INTLVL1_bit         _BIT_ACCESS(DMACON2,1)
// DMACON2<INTLVL2>
extern volatile __bit                   INTLVL2             __at(0x7C32);	// @ (0xF86 * 8 + 2)
#define                                 INTLVL2_bit         _BIT_ACCESS(DMACON2,2)
// DMACON2<INTLVL3>
extern volatile __bit                   INTLVL3             __at(0x7C33);	// @ (0xF86 * 8 + 3)
#define                                 INTLVL3_bit         _BIT_ACCESS(DMACON2,3)
// OSCTUNE<INTSRC>
extern volatile __bit                   INTSRC              __at(0x7CDF);	// @ (0xF9B * 8 + 7)
#define                                 INTSRC_bit          _BIT_ACCESS(OSCTUNE,7)
// PPSCON<IOLOCK>
extern volatile __bit                   IOLOCK              __at(0x77F8);	// @ (0xEFF * 8 + 0)
#define                                 IOLOCK_bit          _BIT_ACCESS(PPSCON,0)
// RCON<IPEN>
extern volatile __bit                   IPEN                __at(0x7E87);	// @ (0xFD0 * 8 + 7)
#define                                 IPEN_bit            _BIT_ACCESS(RCON,7)
// OSCCON<IRCF0>
